package jan09;

public class Study {

	/*
	 * 지금까지 공부한 것
	 * 
	 * 초급 : 변수 ~ 배열
	 * 변수, 상수
	 * 데이터 타입
	 * 형태 변환
	 * 연산자
	 * 표기법
	 * 제어문
	 * 배열
	 * 
	 * 중급 : 클래스 ~ 컬렉션
	 * 클래스 메소드
	 * 정적 변수
	 * new
	 * null, 기본 값
	 * 생성자, 기본 생성자
	 * 접근 제어자
	 * 인스턴스 변수, 클래스 변수
	 * 상속
	 * 오버라이딩, 오버로딩 
	 * 추상화 (객체 못만듬)
	 * 인터페이스
	 * 인스턴스
	 * 다형성
	 * 패키지
	 * 어노테이션 : @ (흐름제어)
	 * jar 연동
	 * 최상위 타입 : Object
	 * 래퍼 클래스
	 * 컬렉션 : List, Set, Map, stack(LIFO), queue(FIFO)
	 * final
	 * enum
	 * JVM -- 구조 -- (공부해야 함)
	 * 
	 * 고급 : 예외처리 ~ 네트워킹 (배울 것들)
	 * 
	 * 
	 * 앞으로 할 것
	 * DB
	 * JSP
	 * SPRING
	 * JS, JQ, 
	 */
	
}
