package coll;

// 컬렉션 스택, 큐

/* 자료 구조
 * 	스택 : 차곡차곡 쌓아 올린 형태의 자료 구조 : 후입선출
 * 
 *  특징
 *  - 웹 브라우저 방문 기록 (뒤로 가기)
 *  	가장 나중에 열린 페이지부터 다시 보여준다.
 *  - 역순 문자열 만들기
 *  	가장 나중에 입력된 문자부터 출력한다.
 *  - 실행 취소 (undo)
 *  	가장 나중에 실행된 부터 실행을 취소한다.
 *  - 후위 표기법 계산
 *  	수식의 괄호 검사 (연산자 우선순위 표현을 위한 괄호 검사)
 * 
 * 
 *  큐 : 줄을 서서 기다리는것 : 선입선출
 *  
 *  특징
 *  - 큐의 가장 첫 원소를 front, 가장 끝 원소를 rear
 *  큐는 들어올 때 rear로 들어오지만 나올때는 front부터 빠지는 특성
 *  접근 방법은 가장 첫 원소와 끝 원소로만 가능
 *  가장 먼저 들어온 프론트 원소가 가장 먼저 삭제
 *  
 *   - 우선순위가 같은 작업 예약 (프린트 인쇄 대기열)
 *   - 은행 업무
 *   - 콜센터 고객 대기시간
 *   - 프로세스 관리
 *   - 너비 우선 탐색 (BFS, Breadth-First Search) 구현
 *   - 캐시 (Cache) 구현
 */

public class Stack01 {

	
	
}
